In [1]:
#3049
import pandas as pd
dogs = pd.read_csv("dogs.csv")
print(dogs)

      Name        Breed  Color  Height(cm)  Weight(kg) Date of Birth Sex
0    Bella     Labrador  Brown          56          25    01-07-2013   M
1  Charlie       Poodle  Black          43          23    16-09-2016   F
2     Lucy    Chow Chow  Brown          46          22    25-08-2014   M
3   Cooper    Schnauzer   Gray          49          17    12-11-2011   F
4      Max     Labrador  Black          59          29    20-01-2017   F
5   Stella    Chihuahua    Tan          18           2    20-04-2015   M
6   Bernie  St. Bernard  White          77          74    27-02-2018   M

In [2]:
#3049
dogs.columns

Index(['Name', 'Breed', 'Color', 'Height(cm)', 'Weight(kg)', 'Date of Birth',
       'Sex'],
      dtype='object')

In [3]:
#3049
dogs.index

RangeIndex(start=0, stop=7, step=1)

In [4]:
#3049
dogs_ind = dogs.set_index("Name")
print(dogs_ind)

               Breed  Color  Height(cm)  Weight(kg) Date of Birth Sex
Name
Bella       Labrador  Brown          56          25    01-07-2013   M
Charlie       Poodle  Black          43          23    16-09-2016   F
Lucy       Chow Chow  Brown          46          22    25-08-2014   M
Cooper     Schnauzer   Gray          49          17    12-11-2011   F
Max         Labrador  Black          59          29    20-01-2017   F
Stella     Chihuahua    Tan          18           2    20-04-2015   M
Bernie   St. Bernard  White          77          74    27-02-2018   M

In [5]:
#3049
dogs_ind.reset_index()

      Name        Breed  Color  Height(cm)  Weight(kg) Date of Birth Sex
0    Bella     Labrador  Brown          56          25    01-07-2013   M
1  Charlie       Poodle  Black          43          23    16-09-2016   F
2     Lucy    Chow Chow  Brown          46          22    25-08-2014   M
3   Cooper    Schnauzer   Gray          49          17    12-11-2011   F
4      Max     Labrador  Black          59          29    20-01-2017   F
5   Stella    Chihuahua    Tan          18           2    20-04-2015   M
6   Bernie  St. Bernard  White          77          74    27-02-2018   M

In [6]:
#3049
dogs_ind.reset_index(drop=True)

         Breed  Color  Height(cm)  Weight(kg) Date of Birth Sex
0     Labrador  Brown          56          25    01-07-2013   M
1       Poodle  Black          43          23    16-09-2016   F
2    Chow Chow  Brown          46          22    25-08-2014   M
3    Schnauzer   Gray          49          17    12-11-2011   F
4     Labrador  Black          59          29    20-01-2017   F
5    Chihuahua    Tan          18           2    20-04-2015   M
6  St. Bernard  White          77          74    27-02-2018   M

In [7]:
#3049
dogs[dogs["Name"].isin(["Bella", "Stella"])]

     Name      Breed  Color  Height(cm)  Weight(kg) Date of Birth Sex
0   Bella   Labrador  Brown          56          25    01-07-2013   M
5  Stella  Chihuahua    Tan          18           2    20-04-2015   M

In [8]:
#3049
dogs_ind.loc[["Bella", "Stella"]]

            Breed  Color  Height(cm)  Weight(kg) Date of Birth Sex
Name
Bella    Labrador  Brown          56          25    01-07-2013   M
Stella  Chihuahua    Tan          18           2    20-04-2015   M

In [9]:
#3049
dogs_ind2 = dogs.set_index("Breed")
print(dogs_ind2)

                Name  Color  Height(cm)  Weight(kg) Date of Birth Sex
Breed
Labrador       Bella  Brown          56          25    01-07-2013   M
Poodle       Charlie  Black          43          23    16-09-2016   F
Chow Chow       Lucy  Brown          46          22    25-08-2014   M
Schnauzer     Cooper   Gray          49          17    12-11-2011   F
Labrador         Max  Black          59          29    20-01-2017   F
Chihuahua     Stella    Tan          18           2    20-04-2015   M
St. Bernard   Bernie  White          77          74    27-02-2018   M

In [10]:
#3049
dogs_ind2.loc["Labrador"]

           Name  Color  Height(cm)  Weight(kg) Date of Birth Sex
Breed
Labrador  Bella  Brown          56          25    01-07-2013   M
Labrador    Max  Black          59          29    20-01-2017   F

In [11]:
#3049
dogs_ind3 = dogs.set_index(["Breed", "Color"])
print(dogs_ind3)

                      Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed       Color
Labrador    Brown    Bella          56          25    01-07-2013   M
Poodle      Black  Charlie          43          23    16-09-2016   F
Chow Chow   Brown     Lucy          46          22    25-08-2014   M
Schnauzer   Gray    Cooper          49          17    12-11-2011   F
Labrador    Black      Max          59          29    20-01-2017   F
Chihuahua   Tan     Stella          18           2    20-04-2015   M
St. Bernard White   Bernie          77          74    27-02-2018   M

In [12]:
#3049
dogs_ind3.loc[["Labrador", "Chihuahua"]]

                   Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed     Color
Labrador  Brown   Bella          56          25    01-07-2013   M
          Black     Max          59          29    20-01-2017   F
Chihuahua Tan    Stella          18           2    20-04-2015   M

In [13]:
#3049
dogs_ind3.loc[[("Labrador", "Brown"), ("Chihuahua", "Tan")]]

                   Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed     Color
Labrador  Brown   Bella          56          25    01-07-2013   M
Chihuahua Tan    Stella          18           2    20-04-2015   M

In [14]:
#3049
dogs_ind3.sort_index()

                      Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed       Color
Chihuahua   Tan     Stella          18           2    20-04-2015   M
Chow Chow   Brown     Lucy          46          22    25-08-2014   M
Labrador    Black      Max          59          29    20-01-2017   F
            Brown    Bella          56          25    01-07-2013   M
Poodle      Black  Charlie          43          23    16-09-2016   F
Schnauzer   Gray    Cooper          49          17    12-11-2011   F
St. Bernard White   Bernie          77          74    27-02-2018   M

In [15]:
#3049
dogs_ind3.sort_index(level=["Color", "Breed"], ascending=[True, False])

                      Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed       Color
Poodle      Black  Charlie          43          23    16-09-2016   F
Labrador    Black      Max          59          29    20-01-2017   F
            Brown    Bella          56          25    01-07-2013   M
Chow Chow   Brown     Lucy          46          22    25-08-2014   M
Schnauzer   Gray    Cooper          49          17    12-11-2011   F
Chihuahua   Tan     Stella          18           2    20-04-2015   M
St. Bernard White   Bernie          77          74    27-02-2018   M

In [16]:
#3049
breeds = ["Labrador", "Poodle", "Chow Chow", "Schnauzer", "Labrador", "Chihuahua", "St. Bernard"]

In [17]:
#3049
breeds[2:5]

['Chow Chow', 'Schnauzer', 'Labrador']

In [18]:
#3049
breeds[:3]

['Labrador', 'Poodle', 'Chow Chow']

In [19]:
#3049
breeds[:]

['Labrador',
 'Poodle',
 'Chow Chow',
 'Schnauzer',
 'Labrador',
 'Chihuahua',
 'St. Bernard']

In [20]:
#3049
dogs_srt = dogs.set_index(["Breed", "Color"]).sort_index()
print(dogs_srt)

                      Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed       Color
Chihuahua   Tan     Stella          18           2    20-04-2015   M
Chow Chow   Brown     Lucy          46          22    25-08-2014   M
Labrador    Black      Max          59          29    20-01-2017   F
            Brown    Bella          56          25    01-07-2013   M
Poodle      Black  Charlie          43          23    16-09-2016   F
Schnauzer   Gray    Cooper          49          17    12-11-2011   F
St. Bernard White   Bernie          77          74    27-02-2018   M

In [21]:
#3049
dogs_srt.loc["Chow Chow":"Poodle"]

                    Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed     Color
Chow Chow Brown     Lucy          46          22    25-08-2014   M
Labrador  Black      Max          59          29    20-01-2017   F
          Brown    Bella          56          25    01-07-2013   M
Poodle    Black  Charlie          43          23    16-09-2016   F

In [22]:
#3049
dogs_srt.loc["Tan":"Grey"]

Empty DataFrame
Columns: [Name, Height(cm), Weight(kg), Date of Birth, Sex]
Index: []

In [23]:
#3049
dogs_srt.loc[("Labrador", "Brown"):("Schnauzer", "Grey")]

                    Name  Height(cm)  Weight(kg) Date of Birth Sex
Breed     Color
Labrador  Brown    Bella          56          25    01-07-2013   M
Poodle    Black  Charlie          43          23    16-09-2016   F
Schnauzer Gray    Cooper          49          17    12-11-2011   F

In [24]:
#3049
dogs_srt.loc[:, "Name":"Height(cm)"]

                      Name  Height(cm)
Breed       Color
Chihuahua   Tan     Stella          18
Chow Chow   Brown     Lucy          46
Labrador    Black      Max          59
            Brown    Bella          56
Poodle      Black  Charlie          43
Schnauzer   Gray    Cooper          49
St. Bernard White   Bernie          77

In [25]:
#3049
dogs_srt.loc[("Labrador", "Brown"):("Schnauzer", "Grey"),"Name":"Height(cm)"]

                    Name  Height(cm)
Breed     Color
Labrador  Brown    Bella          56
Poodle    Black  Charlie          43
Schnauzer Gray    Cooper          49

In [26]:
#3049
dogs = dogs.set_index("Date of Birth").sort_index()
print(dogs)

                  Name        Breed  Color  Height(cm)  Weight(kg) Sex
Date of Birth
01-07-2013       Bella     Labrador  Brown          56          25   M
12-11-2011      Cooper    Schnauzer   Gray          49          17   F
16-09-2016     Charlie       Poodle  Black          43          23   F
20-01-2017         Max     Labrador  Black          59          29   F
20-04-2015      Stella    Chihuahua    Tan          18           2   M
25-08-2014        Lucy    Chow Chow  Brown          46          22   M
27-02-2018      Bernie  St. Bernard  White          77          74   M

In [27]:
#3049
dogs.loc["2014-08-25":"2016-09-16"]

Empty DataFrame
Columns: [Name, Breed, Color, Height(cm), Weight(kg), Sex]
Index: []

In [28]:
#3049
dogs.loc["2014":"2016"]

Empty DataFrame
Columns: [Name, Breed, Color, Height(cm), Weight(kg), Sex]
Index: []

In [29]:
#3049
print(dogs.iloc[2:5, 1:4])

                   Breed  Color  Height(cm)
Date of Birth
16-09-2016        Poodle  Black          43
20-01-2017      Labrador  Black          59
20-04-2015     Chihuahua    Tan          18

In [30]:
#3049
print(dogs)

                  Name        Breed  Color  Height(cm)  Weight(kg) Sex
Date of Birth
01-07-2013       Bella     Labrador  Brown          56          25   M
12-11-2011      Cooper    Schnauzer   Gray          49          17   F
16-09-2016     Charlie       Poodle  Black          43          23   F
20-01-2017         Max     Labrador  Black          59          29   F
20-04-2015      Stella    Chihuahua    Tan          18           2   M
25-08-2014        Lucy    Chow Chow  Brown          46          22   M
27-02-2018      Bernie  St. Bernard  White          77          74   M

In [31]:
#3049
dogs_height_by_breed_vs_color = dogs.pivot_table("Height(cm)", index="Breed", columns="Color")
print(dogs_height_by_breed_vs_color)

Color        Black  Brown  Gray   Tan  White
Breed
Chihuahua      NaN    NaN   NaN  18.0    NaN
Chow Chow      NaN   46.0   NaN   NaN    NaN
Labrador      59.0   56.0   NaN   NaN    NaN
Poodle        43.0    NaN   NaN   NaN    NaN
Schnauzer      NaN    NaN  49.0   NaN    NaN
St. Bernard    NaN    NaN   NaN   NaN   77.0

In [32]:
#3049
dogs_height_by_breed_vs_color.loc["Chow Chow":"Poodle"]

Color      Black  Brown  Gray  Tan  White
Breed
Chow Chow    NaN   46.0   NaN  NaN    NaN
Labrador    59.0   56.0   NaN  NaN    NaN
Poodle      43.0    NaN   NaN  NaN    NaN

In [33]:
#3049
dogs_height_by_breed_vs_color.mean(axis="index")

Color
Black    51.0
Brown    51.0
Gray     49.0
Tan      18.0
White    77.0
dtype: float64

In [34]:
#3049
dogs_height_by_breed_vs_color.mean(axis="columns")

Breed
Chihuahua      18.0
Chow Chow      46.0
Labrador       57.5
Poodle         43.0
Schnauzer      49.0
St. Bernard    77.0
dtype: float64